In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -1.035316  0.129091
1    a  two -0.538269 -0.075869
2    b  one  0.226084  1.025517
3    b  two  1.922168  1.572212
4    a  one -0.543916  0.408161

In [2]:
#Series的Groupby
grouped = df['data1'].groupby(['台北','台北','台北','台中','台中'])
grouped

In [3]:
grouped.mean()

台中    0.689126
台北   -0.449167
Name: data1, dtype: float64

In [4]:
df['data1'].groupby(df['key2']).mean()

key2
one   -0.451049
two    0.691950
Name: data1, dtype: float64

In [5]:
s1 = df['data1'].groupby([df['key1'],df['key2']]).mean()
s1

key1  key2
a     one    -0.789616
      two    -0.538269
b     one     0.226084
      two     1.922168
Name: data1, dtype: float64

In [6]:
s1.unstack(level='key1')

key1         a         b
key2
one  -0.789616  0.226084
two  -0.538269  1.922168

In [7]:
df.groupby('key1')['data1'].mean()

key1
a   -0.705834
b    1.074126
Name: data1, dtype: float64

In [8]:
df.groupby('key1')[['data1','data2']].mean()

         data1     data2
key1
a    -0.705834  0.153795
b     1.074126  1.298865

In [9]:
df.groupby(['key1','key2'])[['data1','data2']].sum()

              data1     data2
key1 key2
a    one  -1.579232  0.537253
     two  -0.538269 -0.075869
b    one   0.226084  1.025517
     two   1.922168  1.572212